# very important stuff
brew "jj"
brew "fish"
brew "helix"
cask "zed@preview"

# stuff
brew "bat"
brew "dust"
brew "fend"
brew "jq"
brew "htop"
brew "tree"
brew "pv"
brew "ripgrep"
brew "scc"
brew "uv"
brew "yq"

# junction
brew "awscli"
brew "grpcurl"
brew "fnm"
brew "k3d"
brew "postgresql@17", restart_service: :changed, link: true
brew "protobuf"
brew "sqlfluff"
brew "sqlx-cli"

# blog
brew "zola"
